first_routes_and_controllers/app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    user = User.find(params[:id]).destroy